export default () => {
  const coreData = [
    {
      序号: 1,
      不含铜厚度: 0.1,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.135,
    },
    {
      序号: 2,
      不含铜厚度: 0.115,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.15,
    },
    {
      序号: 3,
      不含铜厚度: 0.145,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.18,
    },
    {
      序号: 4,
      不含铜厚度: 0.165,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.2,
    },
    {
      序号: 5,
      不含铜厚度: 0.215,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.25,
    },
    {
      序号: 6,
      不含铜厚度: 0.265,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.3,
    },
    {
      序号: 7,
      不含铜厚度: 0.315,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.35,
    },
    {
      序号: 8,
      不含铜厚度: 0.365,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.4,
    },
    {
      序号: 9,
      不含铜厚度: 0.395,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.43,
    },
    {
      序号: 10,
      不含铜厚度: 0.415,
      顶层铜箔: 'H',
      底层铜箔: 'H',
      含铜厚度: 0.45,
    },
  ]

  const boardData = [
    {
      序号: 1,
      光板厚度: 0.1,
      厚度: 0.1,
    },
    {
      序号: 2,
      光板厚度: 0.15,
      厚度: 0.15,
    },
    {
      序号: 34,
      光板厚度: 0.18,
      厚度: 0.18,
    },
    {
      序号: 35,
      光板厚度: 0.2,
      厚度: 0.2,
    },
    {
      序号: 36,
      光板厚度: 0.25,
      厚度: 0.25,
    },
    {
      序号: 37,
      光板厚度: 0.3,
      厚度: 0.3,
    },
    {
      序号: 38,
      光板厚度: 0.35,
      厚度: 0.35,
    },
    {
      序号: 39,
      光板厚度: 0.4,
      厚度: 0.4,
    },
    {
      序号: 40,
      光板厚度: 0.43,
      厚度: 0.43,
    },
    {
      序号: 41,
      光板厚度: 0.45,
      厚度: 0.45,
    },
  ]

  const ppData = [
    {
      序号: 1,
      PP型号: 106,
      厚度: 0.05,
    },
    {
      序号: 2,
      PP型号: 1080,
      厚度: 0.075,
    },
    {
      序号: 3,
      PP型号: 2116,
      厚度: 0.114,
    },
    {
      序号: 4,
      PP型号: 2313,
      厚度: 0.1,
    },
    {
      序号: 5,
      PP型号: 3313,
      厚度: 0.1,
    },
    {
      序号: 6,
      PP型号: 1506,
      厚度: 0.15,
    },
    {
      序号: 7,
      PP型号: 7628,
      厚度: 0.2,
    },
    {
      序号: 8,
      PP型号: '1080H',
      厚度: 0.089,
    },
    {
      序号: 9,
      PP型号: '2116H',
      厚度: 0.127,
    },
    {
      序号: 10,
      PP型号: '7628H',
      厚度: 0.22,
    },
  ]

  const copperFoilData = [
    {
      序号: 1,
      内外: '内层铜箔',
      铜类型: 0.33,
      厚度_OZ: '1/3',
      厚度_mm: 0.012,
    },
    {
      序号: 3,
      内外: '内层铜箔',
      铜类型: 0.5,
      厚度_OZ: 'H',
      厚度_mm: 0.0175,
    },
    {
      序号: 2,
      内外: '内层铜箔',
      铜类型: '0.33_PT_1',
      厚度_OZ: 1,
      厚度_mm: 0.035,
    },
    {
      序号: 4,
      内外: '内层铜箔',
      铜类型: '0.5_PT_1',
      厚度_OZ: 1,
      厚度_mm: 0.035,
    },
    {
      序号: 5,
      内外: '内层铜箔',
      铜类型: 1,
      厚度_OZ: 1,
      厚度_mm: 0.035,
    },
    {
      序号: 6,
      内外: '内层铜箔',
      铜类型: '1_PT_1.5',
      厚度_OZ: 1.5,
      厚度_mm: 0.0525,
    },
    {
      序号: 7,
      内外: '内层铜箔',
      铜类型: 1.5,
      厚度_OZ: 1.5,
      厚度_mm: 0.0525,
    },
    {
      序号: 8,
      内外: '内层铜箔',
      铜类型: '1.5_PT_2',
      厚度_OZ: 2,
      厚度_mm: 0.07,
    },
    {
      序号: 9,
      内外: '内层铜箔',
      铜类型: 2,
      厚度_OZ: 2,
      厚度_mm: 0.07,
    },
    {
      序号: 10,
      内外: '内层铜箔',
      铜类型: '2_PT_3',
      厚度_OZ: 3,
      厚度_mm: 0.105,
    },
  ]

  // 铜箔关系对应表
  const copperFoilThickness = {
    'p_1/4': { 序号: 1, 厚度_OZ: '1/4', 厚度_mm: 0.009, 厚度_mil: 0.35 },
    'p_1/3': { 序号: 2, 厚度_OZ: '1/3', 厚度_mm: 0.012, 厚度_mil: 0.47 },
    p_H: { 序号: 3, 厚度_OZ: 'H', 厚度_mm: 0.018, 厚度_mil: 0.69 },
    p_1: { 序号: 4, 厚度_OZ: '1', 厚度_mm: 0.035, 厚度_mil: 1.38 },
    'p_1.5': { 序号: 5, 厚度_OZ: '1.5', 厚度_mm: 0.053, 厚度_mil: 2.07 },
    p_2: { 序号: 6, 厚度_OZ: '2', 厚度_mm: 0.07, 厚度_mil: 2.76 },
    p_3: { 序号: 7, 厚度_OZ: '3', 厚度_mm: 0.105, 厚度_mil: 4.13 },
    p_4: { 序号: 8, 厚度_OZ: '4', 厚度_mm: 0.14, 厚度_mil: 5.51 },
    p_5: { 序号: 9, 厚度_OZ: '5', 厚度_mm: 0.175, 厚度_mil: 6.89 },
    p_6: { 序号: 10, 厚度_OZ: '6', 厚度_mm: 0.21, 厚度_mil: 8.27 },
  }

  return {
    coreData,
    boardData,
    ppData,
    copperFoilData,
    copperFoilThickness,
  }
}
